ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32F4/TARGET_STM32F429xI/TARGET_NUCLEO_F429ZI/PeripheralPins.c
/************SAI***************/
const PinMap PinMap_SAI_MCLK[] = {
    {PC_6,      I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI2)}, // I2S2_MCK
    {PC_7,      I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SPI3)}, // I2S3_MCK
    {PE_2,      SAI_1_A,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SAI1)}, // SAI1_MCLK_A
    {PF_7,      SAI_1_B,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SAI1)}, // SAI1_MCLK_B

    {NC   , NC, 0}
};
const PinMap PinMap_SAI_SD[] = {
    {PB_4,      I2S_3_ext,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_I2S3ext)},// I2S3ext_SD
    {PB_5,      I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SPI3)},   // I2S3_SD
    {PB_14,     I2S_2_ext,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_I2S2ext)},// I2S2ext_SD
    {PB_15,     I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI2)},   // I2S2_SD
    {PC_2,      I2S_2_ext,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_I2S2ext)},// I2S2ext_SD
    {PC_3,      I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI2)},   // I2S2_SD
    {PC_11,     I2S_3_ext,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_I2S3ext)},// I2S3ext_SD
    {PC_12,     I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SPI3)},   // I2S3_SD
    {PD_6,      I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI3)},   // I2S3_SD
    {PD_6_ALT0, SAI_1_A,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SAI1)},   // SAI1_SD_A
    {PE_3,      SAI_1_B,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SAI1)},   // SAI1_SD_B
    {PE_6,      SAI_1_A,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SAI1)},   // SAI1_SD_A
    {PF_6,      SAI_1_B,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_SAI1)},   // SAI1_SD_B
    {PI_2,      I2S_2_ext,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF6_I2S2ext)},// I2S2ext_SD
    {PI_3,      I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI2)},   // I2S2_SD

    {NC   , NC, 0}
};
const PinMap PinMap_SAI_BCLK[] = {
    {PB_3,      I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SPI3)},   // I2S3_CK
    {PB_10,     I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},   // I2S2_CK
    {PB_13,     I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},   // I2S2_CK
    {PC_9,      I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},   // I2S_CKIN
    {PC_9_ALT0, I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI3)},   // I2S_CKIN
    {PC_10,     I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SPI3)},   // I2S3_CK
    {PD_3,      I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},   // I2S2_CK
    {PE_5,      SAI_1_A,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SAI1)},   // SAI1_SCK_A
    {PF_8,      SAI_1_B,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SAI1)},   // SAI1_SCK_B
    {PI_1,      I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},   // I2S2_CK (7. PI0 and PI1 cannot be used for I2S2 full-duplex mode.)

    {NC   , NC, 0}
};
const PinMap PinMap_SAI_WCLK[] = {
    {PA_4,      I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SPI3)},   // I2S3_WS
    {PA_15,     I2S_3,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SPI3)},   // I2S3_WS
    {PB_9,      I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},   // I2S2_WS
    {PB_12,     I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},   // I2S2_WS
    {PE_4,      SAI_1_A,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SAI1)},   // SAI1_FS_A
    {PF_9,      SAI_1_B,    STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SAI1)},   // SAI1_FS_B
    {PI_0,      I2S_2,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},   // I2S2_WS (7. PI0 and PI1 cannot be used for I2S2 full-duplex mode.)

    {NC   , NC, 0}
};
